; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v6 ?v11)
             (pred_11 ?v8 ?v3)
             (pred_4 ?v6 ?v3)
             (pred_5 ?v10 ?v6 )
	     (pred_8 ?v6)
             (pred_2 ?v1)
             (pred_1 ?v8)
             (pred_10 ?v3)
             (pred_7 ?v6)
             (pred_6 ?v8)
             (pred_12 ?v6)
             (pred_9 ))



(:action op_2
:parameters (?v12 ?v7 ?v5 ?v2)
:precondition (and (pred_2 ?v12) (pred_2 ?v7) (pred_1 ?v5) (pred_10 ?v2)
          (pred_3 ?v12 ?v7) (pred_11 ?v5 ?v2)
                   (pred_4 ?v7 ?v2) (pred_8 ?v12) 
                   (pred_7 ?v7) (pred_6 ?v5))
:effect (and  (pred_12 ?v7) (not (pred_7 ?v7))))


(:action op_3
:parameters (?v12 ?v13)
:precondition (and (pred_2 ?v12) (pred_2 ?v13)
               (pred_8 ?v12) (pred_3 ?v12 ?v13) (pred_12 ?v13))
:effect (and (pred_8 ?v13) (not (pred_8 ?v12))))

(:action op_1
:parameters (?v12 ?v5)
:precondition (and (pred_2 ?v12) (pred_1 ?v5) 
                  (pred_8 ?v12) (pred_5 ?v5 ?v12) (pred_9 ))
:effect (and (pred_6 ?v5)
   (not (pred_5 ?v5 ?v12)) (not (pred_9 ))))


(:action op_5
:parameters (?v12 ?v4 ?v9)
:precondition (and (pred_2 ?v12) (pred_1 ?v4) (pred_1 ?v9)
                  (pred_8 ?v12) (pred_6 ?v9) (pred_5 ?v4 ?v12))
:effect (and (pred_6 ?v4) (pred_5 ?v9 ?v12)
        (not (pred_6 ?v9)) (not (pred_5 ?v4 ?v12))))

(:action op_4
:parameters (?v12 ?v5)
:precondition (and (pred_2 ?v12) (pred_1 ?v5) 
                  (pred_8 ?v12) (pred_6 ?v5))
:effect (and (pred_9 ) (pred_5 ?v5 ?v12) (not (pred_6 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_11 obj_16 obj_04 obj_02 obj_17 obj_18 obj_20 obj_12 obj_01 obj_19 obj_06 obj_15 obj_13 obj_14 obj_22
    obj_03 obj_08 obj_21
    obj_09 obj_05 obj_10
    )

    (:init
       (pred_9)

       (pred_2 obj_07)
       (pred_2 obj_11)
       (pred_2 obj_16)
       (pred_2 obj_04)
       (pred_2 obj_02)
       (pred_2 obj_17)
       (pred_2 obj_18)
       (pred_2 obj_20)
       (pred_2 obj_12)
       (pred_2 obj_01)
       (pred_2 obj_19)
       (pred_2 obj_06)
       (pred_2 obj_15)
       (pred_2 obj_13)
       (pred_2 obj_14)
       (pred_2 obj_22)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_21)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_10)

       (pred_3 obj_07 obj_02)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_04 obj_20)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_02 obj_12)
       (pred_3 obj_02 obj_17)
       (pred_3 obj_02 obj_07)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_17 obj_02)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_20 obj_04)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_01)
       (pred_3 obj_12 obj_02)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_12)
       (pred_3 obj_19 obj_14)
       (pred_3 obj_19 obj_06)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_06 obj_22)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_19)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_14 obj_22)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_22 obj_06)
       (pred_3 obj_22 obj_14)
       (pred_7 obj_18)
       (pred_7 obj_12)
       (pred_7 obj_16)
       (pred_4  obj_18 obj_03)
       (pred_4  obj_12 obj_08)
       (pred_4  obj_16 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_20)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_06)
       (pred_12 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_14)
       (pred_12 obj_22)

       (pred_11  obj_09 obj_03)
       (pred_11  obj_05 obj_08)
       (pred_11  obj_10 obj_21)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_10 obj_18)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_5 obj_09 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_19)))
)
)

; plan
1. (op_3 obj_02 obj_17)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_17)
   goals met: 0 of 1
2. (op_3 obj_17 obj_01)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_01)
   goals met: 0 of 1
3. (op_3 obj_01 obj_13)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_13)
   goals met: 0 of 1
4. (op_3 obj_13 obj_15)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_15)
   goals met: 0 of 1
5. (op_1 obj_15 obj_09)
   deleted: (pred_5 obj_09 obj_15) (pred_9)
   added: (pred_6 obj_09)
   goals met: 0 of 1
6. (op_3 obj_15 obj_13)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_14)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_14)
   goals met: 0 of 1
8. (op_3 obj_14 obj_22)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_22)
   goals met: 0 of 1
9. (op_3 obj_22 obj_06)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_06)
   goals met: 0 of 1
10. (op_3 obj_06 obj_20)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_20)
   goals met: 0 of 1
11. (op_3 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 0 of 1
12. (op_4 obj_04 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_9) (pred_5 obj_09 obj_04)
   goals met: 1 of 1
